import Footer from "../Components/Footer";
import Header from "../Components/Header";
import MelshantiImage from "../assets/Melshanti.png";
import RekshadikariImage from "../assets/Rekshadikari.png";

function TempleHistoryPage() {
  return (
    <div>
      <Header />
      <div className="bg-gradient-to-b from-[#fc941e80] to-white p-20">
        <div className="flex justify-end  gap-x-5">
          <div className="flex flex-col items-center gap-y-3">
            <img
              src={RekshadikariImage}
              alt="Image of Rekshadikari."
              className="w-[10vw] h-[20vh]"
            />
            <p className="font-semibold">രക്ഷാധികാരി</p>
          </div>
          <div className="flex flex-col items-center gap-y-3">
            <img
              src={MelshantiImage}
              alt="Image of Melshanti."
              className="w-[10vw] h-[20vh]"
            />
            <p className="font-semibold">മേൽശാന്തി</p>
          </div>
        </div>
        <div className="mt-10 space-y-10">
          <p className="text-lg font-semibold">
            <span className="text-2xl">പഴുവിൽ ശ്രീ ത്രേതായുഗ മൂർത്തി ക്ഷേത്രം</span> ഒരു തുടർച്ചയാണ്
            സഹസ്രാബ്ദങ്ങളോളം മറഞ്ഞ് കിടന്നിരുന്ന മഹാക്ഷേത്രത്തിൻ്റെ
            പുനരവതരണമെന്ന മഹാദ്ഭുതം. കേരളത്തിൽ തന്നെഹനുമാൻ സ്വാമിക്ക് ഷഢാദന
            പ്രതിഷ്ഠയുള്ള ചുരുക്കം അമ്പലങ്ങളിൽ ഒന്നാണ് നമ്മുടേത്. <span className="text-2xl">ക്ഷേത്രാചാര്യൻ
            ശ്രീ. ഭരതൻ സ്വാമിക്കും അനുജൻ സ്വാമി വിപിൻ മൂത്തേരിയുടെയും</span> ജീവിതത്തിൽ
            സംഭവിച്ച അദ്ഭുത ദർശനങൾ ശ്രീരാമ ഭക്തർക്ക് തുണയായതിൻ്റെയും പുതിയ
            മാർഗ്ഗങ്ങൾ തുറന്നതിൻ്റെയും ചരിത്രമാണ് ഈ ക്ഷേത്രത്തിന് പറയാനുള്ളത്.
          </p>
          <p className="text-lg font-semibold">
            സാധാരണക്കാരിൽ സാധാരണക്കാരനായി ജീവിച്ചിരുന്ന ശ്രീ ഭരതൻ സ്വാമിക്ക്
            <span className="text-2xl"> 1179</span> മിഥുനം <span className="text-2xl">30 2004</span> ജൂലൈ <span className="text-2xl">14</span>ന് സ്വപ്നത്തിൽ വന്ന് തൃപ്രയാർ
            ശ്രീരാമക്ഷേത്രത്തിൽ ദർശനം നടത്തണമെന്ന് അരുളിപ്പാട് ഉണ്ടായി.
            അതിപ്രകാരം ശ്രീ ഭരതൻ സ്വാമിയും അനിയൻ വിപിയും കൂടി ക്ഷേത്രദർശനം
            നടത്തി.
          </p>
          <p className="text-lg font-semibold">
            കുടുംബത്തിൽ കൂട്ടായ്മ വർദ്ധിക്കാനും ഭക്തി നിർഭരമായ
            അന്തരീക്ഷമുണ്ടാകണമെന്ന തോന്നലിൽ രാമായണവും വാങ്ങി തിരികെ വന്നു.
          </p>
          <p className="text-lg font-semibold">
            പിന്നീട് കർക്കിടകം ഒന്നുമുതൽ ആരോ പറഞ്ഞു ചെയ്യിപ്പിക്കുന്നത് പോലെ
            പുലർച്ച മൂന്നുമണിക്ക് എഴുന്നേറ്റ് കുളിച്ച് വിളക്ക് വെച്ച് രാമായണം
            വായിച്ചു തുടങ്ങി. അന്നുവരെ രാമായണം വായിച്ചിട്ടില്ലാത്ത ഭരതൻ
            സ്വാമിക്ക് വായിക്കുമ്പോൾ ഉണ്ടാകുന്ന തെറ്റുകളിൽ മാനസിക കുറ്റബോധം വരെ
            ഉണ്ടായിരുന്നു. എങ്കിലും സന്ധ്യക്ക് തുടങ്ങി രാത്രി 8 മണി വരെ
            തുടർച്ചയായി വായിക്കും . രാമായണ പാരായണം തുടങ്ങി പതിനഞ്ചാം ദിവസം
            രാത്രി 8.10 നു ശേഷം സ്വാമിയുടെ കുടുംബം ഭക്ഷണം കഴിക്കാൻ പറയുകയും
            പോകട്ടെ എന്ന് പറഞ്ഞു. ഭരതൻ സ്വാമി ആണെങ്കിൽ 10 പേജ് കൂടിയേ ഉള്ളൂ അത്
            അവസാനിപ്പിച്ച് എണീക്കാം എന്ന് കരുതി വായന തുടരുകയും അവസാന പേജ്
            എത്തിയപ്പോൾ ശരീരത്തിൽ ഒരു ദിവ്യ അനുഭൂതിയിൽ നിറയുന്നതു പോലെ
            അനുഭവപ്പെട്ടു. ഒരു ചെറിയ കാറ്റ് വീശുകയും കൂടി ചെയ്തപ്പോൾ അദ്ദേഹം
            ചുറ്റും ഒന്ന് വീക്ഷിച്ചു ,എന്തോ ഏതോ എന്നറിയാത്ത ഒരു പ്രത്യേകത എന്നു
            വരെ വായിക്കുമ്പോൾ ഉണ്ടാവുകയും അടുത്ത നിമിഷം വായന കഴിഞ്ഞപ്പോൾ{" "}
            <span className="text-[#FC931E]">
              അമ്പും വില്ലും ഏന്തിയ ശ്രീരാമൻ സ്വാമിയും സീതാദേവിയും മുമ്പിൽ
              വീടിൻ്റെ മുറ്റത്ത് ഭരതൻ സ്വാമിക്ക് ദർശനം നൽകി
            </span>
            . മറക്കാൻ പറ്റാത്ത ആനന്ദ നിമിഷത്തിൽ പൗർണമി നിലാവിൽ മഞ്ഞപ്പട്ടെടുത്ത്
            ഭഗവാനും ചുവന്ന പട്ടെടുത്ത് ആഭരണങ്ങളോട് കൂടിയ സീതാദേവിയും കണ്ടതോടെ ആ
            സാധാരണ ക്കാരൻ്റെ മനസ്സിൽ നിന്നും കണ്ണീരൊഴുകി അത് ആനന്ദ
            കണ്ണീരായിരുന്നു.
          </p>
          <p className="text-lg font-semibold">
            എന്തെന്നാൽ ഇതുവരെ തൃപ്രയാർ അമ്പലത്തിൽ പോകാത്ത, രാമായണ പാരായണത്തിൽ
            തെറ്റുകൾ ഒരു പാട് സംഭവിച്ചിട്ടും ഭഗവാന്റെ ദർശനം കിട്ടിയല്ലോ എന്ന
            ആശ്ചര്യകരമായ സത്യം അദ്ദേഹത്തെ ശ്രീരാമ ഭക്തിയുടെ പരമാനന്ദത്തിലെ
            ത്തിച്ചു.അന്ന് അത്താഴം കഴിക്കുമ്പോൾ വീട്ടുകാരോട് ഈ വിവരം പറഞ്ഞപ്പോൾ
            അവർക്ക് ആശ്ചര്യവും സങ്കടവുമായി മാറി. ദർശനസമയത്ത് തങ്ങളെ
            വിളിച്ചില്ലെന്ന പരിഭവം.അപ്പോൾ ഇനിയും ദിവസം ഉണ്ടല്ലോ, നാളെ മുതൽ
            വീണ്ടും രാമായണ പാരായണം നടത്തണമെന്ന് ഏക കണ്ഠമായി തീരുമാനിച്ചു
            എങ്കിലും പിറ്റേദിവസം സന്ധ്യക്ക് ബന്ധുവിൻ്റെ വിവാഹത്തിനു എല്ലാവരും
            പോയി.
          </p>
          <p className="text-lg font-semibold">
            ആ ദിവസം രാമായണ പാരായണത്തിന് ഭരതൻ സ്വാമിയും അനിയനും മാത്രമേ
            ഉണ്ടായിരുന്നുള്ളൂ.വായന തുടങ്ങി ഒരു പേജ് വായിച്ചപ്പോഴേക്കും അനിയൻ
            വിപിയുടെ ശരീരത്തിൽ എത്തുകയും സാക്ഷാൽ ഹനുമാൻ സ്വാമിയെ പോലെ ആവുകയും
            ചെയ്തു. ഓരോ ശ്വാസം വലിച്ചു വിടുമ്പോഴും കൊടുങ്കാറ്റിലെന്ന പോലെ
            മുറ്റത്തെ മൂസാണ്ട ചെടിയുടെ പൂവ് ആടിയുലൊന്നുണ്ടായിരുന്നു. ഇതെല്ലാം
            കണ്ട് സത്യത്തിൽ ഭരതൻ സ്വാമിക്ക് തൊണ്ട വരളുകയും ശബ്ദം പുറത്തു വരാൻ
            പറ്റാത്ത അവസ്ഥയുണ്ടായി.
          </p>
          <p className="text-lg font-semibold">
            പിന്നെ ഒരു നിമിഷം ചിന്തിച്ച് സാക്ഷാൽ ഹനുമാൻ സ്വാമി അല്ലേ താൻ എന്തിനു
            ഭയക്കുന്നു. ഭഗവാൻ്റെ അനുഗ്രഹത്തിനായി പ്രാർത്ഥിക്കുകയും ചെയ്ത നിമിഷം
            അനിയൻ്റെ ശരീരത്തിൽ നിന്ന് ഭഗവാൻ വിട്ടുപോവുകയും ചെയ്തു.
          </p>
          <p className="text-lg font-semibold">
            ഇതാണ് ഞങ്ങൾക്ക് ആദ്യം ഉണ്ടായ അനുഭവം . പിന്നീട് ഭഗവാന്റെ ദർശനം
            കിട്ടിയ ദിവസം നോക്കിയപ്പോൾ 2006 ജൂലൈ മാസം 30, കർക്കിടകം 15
            വെള്ളിയാഴ്ച ഉത്രാടം നക്ഷത്രത്തിലാണെന്നും. ഹനുമദ് ദർശനം ലഭിച്ചത് ജൂലൈ
            31 കർക്കിടകം 16 ശനിയാഴ്ച പൗർണമി തിരുവോണം നക്ഷത്രമാണെന്ന് മനസ്സിലായി.
            അടുത്ത ദിവസം രാമായണ പാരായണം ചെയ്യുമ്പോൾ ഹനുമാൻ സ്വാമിയുടെ ദർശനം
            വീണ്ടും ഉണ്ടായി. അന്ന് സ്വാമിയുടെ വേണ്ടപ്പെട്ടവരും ഉണ്ടായിരുന്നു.{" "}
            <span className="text-[#FC931E]">
              സാമിയുടെ ദർശനത്തിൽ എന്താണ് വേണ്ടത് എന്ന് ചോദിച്ചപ്പോൾ സന്താനം
              വേണമെന്ന് ഭരതൻ സ്വാമി അപേക്ഷിച്ചു.
            </span>
          </p>
          <p className="text-lg font-semibold text-[#FC931E]">
            ഒരു ആൺകുട്ടിയെയാണ് യോഗം എന്ന് പറഞ്ഞു അന്നേരം പെൺകുട്ടി മതിയെന്ന്
            ആവശ്യപ്പെട്ടതിൽ പ്രകാരം കടയിൽ പോയി പഴക്കുല വാങ്ങുകയും അതിൽ നിന്ന്
            പഴമെടുത്ത് ജപിച്ചു തരികയും ചെയ്തു . അതിപ്രകാരം ഉണ്ടാകാൻ പോകുന്ന
            കൊച്ചിനെ അഞ്ജന എന്ന് ഞങ്ങൾ പേരിടും എന്ന് പറഞ്ഞപ്പോൾ ഹനുമാൻ സ്വാമി
            പറഞ്ഞു , ശ്രീരാമസ്വാമി മകളെ സീത എന്ന് പേരു വിളിക്കാൻ നിർദ്ദേശിച്ചു
            എന്ന് . അതിൽപ്രകാരം ലഭിച്ച പഴം കഴിക്കുകയും ഭാര്യ ഗർഭിണി ആവുകയും
            ചെയ്തു . 2005 ശ്രീരാമ നവമി ദിവസം ആയില്യം നാളിൽ പെൺകുട്ടി ജനിക്കുകയും
            സീത എന്ന നാമകരണം ചെയ്യുകയും ഉണ്ടായി.
          </p>
          <p className="text-lg font-semibold">
            പഴം ലഭിച്ച ദിവസം തൊട്ട് അനിയനിലൂടെ രാത്രിയോ പകലോ എന്ന ഭേദമില്ലാതെ
            ഹനുമാൻ സ്വാമി എപ്പോഴും വീട്ടിൽ ഉണ്ടാവുകയും രാമനാമവും ഭഗവാന്റെ കഥകളും
            അല്ലാതെ വേറെയൊന്നും സംസാരിക്കാൻ സ്വാമി അനുവദിച്ചിരുന്നില്ല .
          </p>
          <p className="text-lg font-semibold">
            ആദ്യദിവസം എത്തിയ ഹനുമാൻ സ്വാമി ഞങ്ങളുടെ പൂർവ്വ വാസസ്ഥലമായിരുന്ന
            മരോട്ടി ചുവട്ടിലെ നായാടി മുത്തപ്പന്റെ അടുത്ത് പോവുകയും,ദുർഗയാണ് ഈ
            സ്ഥലം സംബന്ധം ആയിട്ടുള്ള ദേവി എന്നും അരുൾ ചെയ്തു.
          </p>
          <p className="text-lg font-semibold">
            അതിൽ പ്രകാരം ക്ഷേത്രത്തിൻ്റെ മുൻവശത്ത് വന്ന് ദുർഗദേവിയെയും,
            ശിവശക്തിയെ കാടമ്പുഴ ശിവക്ഷേത്രത്തിലെ ചൈതന്യം പോലെ കുറവനും കുറത്തി
            എന്ന സങ്കല്പത്തിൽ ആരാധിച്ചു പോരുന്നു.
          </p>
          <p className="text-lg font-semibold">
            രണ്ടായിരത്തിൽ പരം വർഷങ്ങൾക്കു മുമ്പ് ഇവിടെ ക്ഷേത്രം ഉണ്ടായിരുന്നതായി
            എന്നും അതിൻ്റെ അവശിഷ്ടങ്ങൾ ഇവിടുത്തെ അമ്പലക്കുളത്തിൽ ഉണ്ടെന്നും
            ഭഗവാൻ്റെ അരുളിപ്പാടുണ്ടായി, അങ്ങനെയിരിക്കെ അനിയൻ്റെ സ്വഭാവ
            വ്യത്യാസങ്ങൾ കണ്ട് പഴുവിൽ ശ്രീകൃഷ്ണ പണിക്കരെ കണ്ടു.
          </p>
          <p className="text-lg font-semibold">
            പ്രശ്ന പ്രകാരം ശ്രീരാമസ്വാമി തൻ്റെ കുടുംബത്തെ
            അനുഗ്രഹിച്ചിരിക്കുകയാണെന്ന് പറഞ്ഞപ്പോൾ ,ഒന്നും പറയാതെ തന്നെ തറവാട്ടു
            ക്ഷേത്രത്തിലെ പൂജാരിയെ കാണാൻ തീരുമാനിച്ചു. അദ്ദേഹത്തിൻ്റെ യടുത്ത്
            എത്തിയപ്പോൾ അദ്ദേഹം ഭരതൻ സ്വാമിയെ കാണുവാൻ വീട്ടിലേക്ക്
            വരുവാനിരിക്കുകയായിരുന്നു കേട്ടപ്പോൾ ഞെട്ടിപ്പോയി.
          </p>
          <p className="text-lg font-semibold">
            കാരണം പൂജാരിയും രാത്രി സ്വപ്നം കണ്ടിരുന്നു ഭരതൻ ചേട്ടൻറെ വീട്ടിൽ
            ഹനുമാൻ സ്വാമി എത്തുകയും അവിടെ മഹാക്ഷേത്രം വരുമെന്നും അദ്ദേഹം
            കണ്ടതായി പറഞ്ഞു. അവിടെ താൻ പൂജാരിയായി വരുമെന്നും സത്യം ചെയ്തു. ഇതിനെ
            തുടർന്ന് താംബൂല പ്രശ്നത്തിന് കണിയാനെ കൊണ്ടുവരുകയും പ്രശ്നത്തിൽ
            ഹനുമാൻ സ്വാമിയുടെ പൂർണ്ണ സാന്നിധ്യം ഉണ്ടെന്ന് പറഞ്ഞതിൽ പ്രകാരം,
            ക്ഷേത്രം പണിയുന്നതിൽ രണ്ടുവർഷം എടുക്കുമെന്നും ക്ഷേത്രം കണിയാൻ
            പറഞ്ഞിരിക്കുന്നതിനിടയിൽ
          </p>
          <p className="text-lg font-semibold">
            ഹനുമാൻ സ്വാമി നൃത്തത്തിൽ വരുകയും ആറ് മാസത്തിനുള്ളിൽ ക്ഷേത്രം
            പണിതിരിക്കുമെന്ന് പ്രധാന അനുഷ്ഠാനങ്ങൾ അനുഷ്ഠിക്കാം എന്നും പറഞ്ഞ നേരം
            കെണിയാൻ ഭഗവാനെ മനസ്കരിക്കുകയും ചെയ്തു.
          </p>
          <p className="text-lg font-semibold">
            ഭഗവാൻ്റെ അരുളപ്പാട് പോലെ തന്നെ ഷഡാദാര പ്രതിഷ്ഠയോട് കൂടിയ പ്രതിഷ്ഠ
            നടത്തുകയും ഗ്രാമത്തിന്റെ മഹോത്സവമായി തന്നെ കൊണ്ടാടുകയും ചെയ്തു.
          </p>
          <p className="text-lg font-semibold">
            ഇക്കാലയളവിൽ ഹനുമാൻ സ്വാമിയുടെ സാന്നിധ്യം വീട്ടിലുണ്ടെന്ന് അറിഞ്ഞ്
            ആളുകൾ വീട്ടിലേക്ക് എത്തുകയും , ഭഗവാന്റെ ദർശനം കഴിഞ്ഞ് വീട്ടിലേക്ക്
            എത്തുമ്പോഴേക്കും അവരുടെ കാര്യങ്ങൾ സാധിച്ചിരിക്കുന്നു തുടങ്ങി അദ്ഭുത
            പ്രവർത്തനങ്ങളും തുടർ സംഭവങ്ങളായി.
          </p>
          <p className="text-lg font-semibold">
            ചിങ്ങമാസം പത്താം തീയതി വ്യാഴാഴ്ച ഏകാദേശിക്ക് ഷഡാധാര പ്രതിഷ്ഠയ്ക്ക്
            വേണ്ടി നിശ്ചയിച്ച ദിവസം പൂജാരി കല്ലിടാനുള്ള കല്ല് പൂജിച്ച സമയം
            ഹനുമാൻ സ്വാമി നൃത്തത്തിൽ വന്ന് ആ പൂജിച്ച കല്ല് മരുത്വാ മല
            കയ്യിലേന്തി പറക്കുന്നതിന് തുല്യമായി വീട്ടിൽ നിന്ന് പൂജിച്ച
            കല്ലെടുത്ത് ക്ഷേത്ര സ്ഥാനത്തേക്ക് കുതിച്ചുചാടി .
          </p>
          <p className="text-lg font-semibold">
            അത് കണ്ടു നിന്നവർ ശ്വാസം അടക്കിപ്പിടിച്ച ഭക്ത്യാനുഭവ അനുഭൂതിയിൽ ഹരേ
            രാമ ഹരേ രാമ എന്ന് ഉറക്കെ സ്വയം മറന്ന് ഉറക്കെ നാമം ചൊല്ലി . അവിടെ
            ഉണ്ടായിരുന്ന ആളുകളുടെ ഉള്ളിൽ നിന്ന് വന്ന രാമനാമം ചായക്കടയിലും
            പാടത്തും പറമ്പിലും ഗ്രാമങ്ങളിലും ചർച്ചയായി .
          </p>
          <p className="text-lg font-semibold">
            ജനങ്ങൾ പ്രതിഷ്ഠാദിനത്തിനു ക്ഷേത്രമുറ്റത്ത് തിങ്ങി നിറഞ്ഞു. ഭഗവദ്
            അനുഗ്രഹത്താൽ <span className="text-2xl">1180</span> തുലാമാസം <span className="text-2xl">11</span>ന് <span className="text-2xl">2004</span> ഒക്ടോബർ <span className="text-2xl">27</span> പൗർണമി ദിവസം ആധാര
            ശില തന്ത്രിയുടെ പൂജാകർമ്മങ്ങൾ കഴിഞ്ഞ് നാല് പേരെ കൂടി എടുത്തു
            കൊണ്ടുവന്ന ആധാരശില സ്ഥാപനം ചെയ്തു
          </p>
        </div>
      </div>
      <Footer />
    </div>
  );
}

export default TempleHistoryPage;
